{
    "clients": [
        {
            "companyName": "Backlash Beauty Bar",
            "website": "https://backlashbeautybar.com/",
            "jobTask": "Updated their existing website, which had not been refreshed for several years. This involved a comprehensive update of all services offered to ensure the information was current and accurate. Additionally, I added new stock images to enhance the website's visual appeal and better represent the brand's identity. Finally, I implemented SEO strategies to improve the website's search engine visibility, aiming to drive more organic traffic and increase online presence."
        },
        {
            "companyName": "Ryga Arts Festival",
            "website": "https://www.rygafest.ca/",
            "jobTask": "Updated the website to include this year's program. As part of the marketing team, I collaborated on a comprehensive website makeover, ensuring the design and content were refreshed and aligned with current branding. Additionally, I implemented SEO optimization strategies to enhance search engine visibility and drive more organic traffic to the site."
        },
        {
            "companyName": "Aikins Loop Cooperative",
            "website": "https://www.aikinsloop.com/",
            "jobTask": "Assisted with their ecommerce site by providing SEO optimization and launch support. This included troubleshooting domain issues to ensure a smooth launch and enhancing search engine visibility to drive more organic traffic to the site."
        },
        {
            "companyName": "BarKeep General Store",
            "website": "https://barkeepstore.ca/",
            "jobTask": "Updated their Shopify checkout using Shopify Liquid to include an interactive calendar, allowing customers to easily view their estimated product delivery date. This enhanced the user experience by providing clear and accurate delivery timelines."        },
        {
            "companyName": "Erin Cronie Portfolio",
            "website": "https://www.erincronie.me/",
            "jobTask": "Developed a personal profile website using React, integrating React Helmet for optimized SEO. This project focused on enhancing visibility and search engine rankings while delivering a streamlined and user-friendly experience."
        },
        {
            "companyName": "Shop Cloud9 Calm",
            "website": "https://www.shopcloud9calm.com/",
            "jobTask": "Developed a Shopify store to sell merchandise, focusing on creating a seamless shopping experience and optimizing the platform for eCommerce success. This involved customizing the store layout, integrating product management, and ensuring a user-friendly interface for customers."        }
    ]
}